In [40]:
import pandas as pd

df = pd.read_json('result.json')
df = pd.json_normalize(df.messages)

### –ö—Ç–æ –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –Ω–∞–ø–∏—Å–∞–ª –≤ —á–∞—Ç–µ? –¢–æ–ø 10.

In [48]:
df['from'].value_counts().head(10)

rpuropuu [Greeg'O'Rii']    3011
–ê–Ω–∞—Ç–æ–ª–∏–π –ö–∞—Ä–ø–æ–≤            2076
Max üçø                      1741
oleg                       1132
esperanto                  1055
Ian Pil√©                   1036
Dmitry                      983
Artem Gruzdov               810
Ilya Shishov                786
Yana                        755
Name: from, dtype: int64

### –ö—Ç–æ —á–∞—â–µ –æ—Ç–≤–µ—á–∞–µ—Ç –Ω–∞ —á—å–∏ —Å–æ–æ–±—â–µ–Ω–∏—è? –¢–æ–ø 10 "–æ—Ç–≤–µ—á–∞—Ç–µ–ª–µ–π".

In [49]:
# lets leave columns that are needed for responses statistics calculation
df_response = df[['from_id', 'from','id', 'reply_to_message_id']]
df_response.head()

             from_id             from  id  reply_to_message_id
0                NaN              NaN   1                  NaN
1  channel1430200876   Karpov Courses   3                  NaN
2  channel1430200876   Karpov Courses   4                  NaN
3                NaN              NaN   5                  NaN
4      user467542724  Artem Sedlovsky   6                  4.0

In [15]:
#Top 10 responders
df_top_response = df_response.loc[df_response['reply_to_message_id'].isnull() == False]
df_top_response = df_top_response.groupby(['from_id']).size().sort_values(ascending=False).rename_axis('from_id').reset_index(name='number_of_replies')
df_top_response.head(10)

             from_id  number_of_replies
0      user448250544               1472
1     user1420037240               1173
2     user1474153825                842
3      user148158343                746
4       user58725603                637
5      user458445864                591
6      user474119900                553
7      user290809359                405
8  channel1173846440                387
9      user539902693                384

In [6]:
#List of top 10 responders (needed further)
top_repliers = df_top_response['from_id'].head(10).tolist()
top_repliers

['user448250544',
 'user1420037240',
 'user1474153825',
 'user148158343',
 'user58725603',
 'user458445864',
 'user474119900',
 'user290809359',
 'channel1173846440',
 'user539902693']

In [76]:
# table with responders and their recipients(whom was replied) 
df_response = df_response[df_response.reply_to_message_id != 'NaN'].merge(df_response, left_on='reply_to_message_id', right_on='id', how='left')
df_response

,from_id_x,from_x,id_x,reply_to_message_id_x,from_id_y,from_y,id_y,reply_to_message_id_y
0,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN
1,channel1430200876,Karpov Courses,3,NaN,NaN,NaN,NaN,NaN
2,channel1430200876,Karpov Courses,4,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,5,NaN,NaN,NaN,NaN,NaN
4,user467542724,Artem Sedlovsky,6,4.0,channel1430200876,Karpov Courses,4.0,NaN
...,...,...,...,...,...,...,...,...
37728,channel1430200876,Karpov Courses,43134,NaN,NaN,NaN,NaN,NaN
37729,channel1430200876,Karpov Courses,43135,NaN,NaN,NaN,NaN,NaN
37730,user179404546,–∞–Ω–¥—Ä–µ–π —Ç–µ–Ω–Ω–∏–∫–æ–≤,43136,43135.0,channel1430200876,Karpov Courses,43135.0,NaN
37731,user325769634,Roman Bunin,43138,43136.0,user179404546,–∞–Ω–¥—Ä–µ–π —Ç–µ–Ω–Ω–∏–∫–æ–≤,43136.0,43135.0
37732,user488387177,Marina Gikalo,43139,43135.0,channel1430200876,Karpov Courses,43135.0,NaN

In [80]:
# Top 10 responders to one recipient, count is number of replies 
df_response_info = df_response.rename(columns={"from_id_x": "from_id", "from_x": "from","id_x": "message_id","reply_to_message_id_x": "reply_to_message_id","from_id_y": "to_id", "from_y": "to_name"})
df_response_info = df_response_info[['from_id','from','message_id','reply_to_message_id','to_id', 'to_name']]
df_from_to_repliers = df_response_info.loc[df_response_info['from_id'].isin(top_repliers)]
df_from_to_repliers = df_from_to_repliers.groupby(['from_id','to_id']).size().sort_values(ascending=False).reset_index(name='counts')
df_from_to_repliers.head(10)

          from_id           to_id  counts
0   user448250544  user1420037240     468
1  user1420037240   user448250544     393
2  user1420037240   user458445864      99
3   user448250544   user148158343      87
4   user448250544   user458445864      86
5  user1420037240   user474119900      80
6   user458445864   user448250544      65
7   user458445864  user1420037240      64
8   user474119900  user1420037240      61
9   user448250544   user145764260      60

### –ù–∞—Å–∫–æ–ª—å–∫–æ —ç—Ç–æ –≤–∑–∞–∏–º–Ω–æ? (—Ç–≤–æ—Ä—á–µ—Å–∫–∏–π –≤–æ–ø—Ä–æ—Å, –∏—Å–ø–æ–ª—å–∑—É–π—Ç–µ –ª—é–±—ã–µ –º–µ—Ç—Ä–∏–∫–∏)

In [81]:
df_response_info

,from_id,from,message_id,reply_to_message_id,to_id,to_name
0,NaN,NaN,1,NaN,NaN,NaN
1,channel1430200876,Karpov Courses,3,NaN,NaN,NaN
2,channel1430200876,Karpov Courses,4,NaN,NaN,NaN
3,NaN,NaN,5,NaN,NaN,NaN
4,user467542724,Artem Sedlovsky,6,4.0,channel1430200876,Karpov Courses
...,...,...,...,...,...,...
37728,channel1430200876,Karpov Courses,43134,NaN,NaN,NaN
37729,channel1430200876,Karpov Courses,43135,NaN,NaN,NaN
37730,user179404546,–∞–Ω–¥—Ä–µ–π —Ç–µ–Ω–Ω–∏–∫–æ–≤,43136,43135.0,channel1430200876,Karpov Courses
37731,user325769634,Roman Bunin,43138,43136.0,user179404546,–∞–Ω–¥—Ä–µ–π —Ç–µ–Ω–Ω–∏–∫–æ–≤
37732,user488387177,Marina Gikalo,43139,43135.0,channel1430200876,Karpov Courses

In [82]:
#–ò–Ω—Ñ–æ—Ä–º–∞—Ü–∏—è –Ω–µ —Ç–æ–ª—å–∫–æ –æ —Ç–æ–ø 10 '–æ—Ç–≤–µ—á–∞—Ç–µ–ª—è—Ö' + –æ—Ç–≤–µ—Ç–Ω–æ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ replies 
df_mutual_replies = df_response_info.loc[df_response_info['from_id'].isin(top_repliers)]
df_mutual_replies = df_response_info.loc[df_response_info['to_id'].isin(top_repliers)]
df_mutual_replies = df_mutual_replies.groupby(['from_id','to_id']).size().sort_values(ascending=False).reset_index(name='counts')
df_mutual_replies.head(10)

          from_id           to_id  counts
0   user448250544  user1420037240     468
1  user1420037240   user448250544     393
2  user1420037240   user458445864      99
3   user448250544   user148158343      87
4   user448250544   user458445864      86
5  user1420037240   user474119900      80
6   user458445864   user448250544      65
7   user458445864  user1420037240      64
8   user474119900  user1420037240      61
9  user1474153825   user474119900      55

In [83]:
# reply statistics for specified user
user_id = 'user1474153825'
df_for_user =  df_mutual_replies[(df_mutual_replies['from_id'] == user_id) | (df_mutual_replies['to_id'] == user_id)]
df_for_user

             from_id           to_id  counts
9     user1474153825   user474119900      55
11     user474119900  user1474153825      42
17     user293947789  user1474153825      40
20      user87604320  user1474153825      36
21    user1474153825   user148158343      36
...              ...             ...     ...
1428  user2009464215  user1474153825       1
1431   user420385366  user1474153825       1
1449   user410885384  user1474153825       1
1456   user205154668  user1474153825       1
1458   user204394315  user1474153825       1

[184 rows x 3 columns]

### –í –∫–∞–∫–æ–π —á–∞—Å –¥–Ω—è –∏—Å—Ç–æ—Ä–∏—á–µ—Å–∫–∏ –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –ø–∏—à—É—Ç –≤ —á–∞—Ç?

In [92]:
df_messages_by_time = df[['id', 'date']]
df_messages_by_time.head()

   id                 date
0   1  2021-01-05T16:26:39
1   3  2021-01-05T17:00:17
2   4  2021-01-05T17:00:17
3   5  2021-01-05T18:27:41
4   6  2021-01-05T22:29:20

In [93]:
def get_hour(row):
    return row['date'].split('T')[1][0:2]
df_messages_by_time['hour'] = df_messages_by_time.apply (lambda row: get_hour(row), axis=1)
df_messages_by_time.head()

C:\Users\Acer\AppData\Local\Temp\ipykernel_5672\3793397293.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_messages_by_time['hour'] = df_messages_by_time.apply (lambda row: get_hour(row), axis=1)

   id                 date hour
0   1  2021-01-05T16:26:39   16
1   3  2021-01-05T17:00:17   17
2   4  2021-01-05T17:00:17   17
3   5  2021-01-05T18:27:41   18
4   6  2021-01-05T22:29:20   22

In [94]:
df_messages_by_time['hour'].value_counts().head(1)

20    3162
Name: hour, dtype: int64

### –í –∫–∞–∫–æ–π –¥–µ–Ω—å –ø—Ä–æ–∏–∑–æ—à–ª–æ —Å–∞–º–æ–µ –±–æ–ª—å—à–æ–µ –ø–∞–¥–µ–Ω–∏–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–∞ —Å–æ–æ–±—â–µ–Ω–∏–π –≤ —á–∞—Ç–µ –≤ % –∫ –ø—Ä–µ–¥—ã–¥—É—â–µ–º—É –¥–Ω—é?

In [95]:
def get_day(row):
    return row['date'].split('T')[0]
df_messages_by_time['day'] = df_messages_by_time.apply (lambda row: get_day(row), axis=1)
df_messages_by_time.head()

C:\Users\Acer\AppData\Local\Temp\ipykernel_5672\2215528191.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_messages_by_time['day'] = df_messages_by_time.apply (lambda row: get_day(row), axis=1)

   id                 date hour         day
0   1  2021-01-05T16:26:39   16  2021-01-05
1   3  2021-01-05T17:00:17   17  2021-01-05
2   4  2021-01-05T17:00:17   17  2021-01-05
3   5  2021-01-05T18:27:41   18  2021-01-05
4   6  2021-01-05T22:29:20   22  2021-01-05

In [96]:
# count how many messages were sent each day
df_new = pd.DataFrame({'day_count' : df_messages_by_time.groupby( [ "day"] ).size()}).reset_index()
df_new.head()

          day  day_count
0  2021-01-05          5
1  2021-01-09          4
2  2021-01-10          4
3  2021-01-11          1
4  2021-01-12          1

In [100]:
df_new['%'] = df_new['day_count'].div(df_new['day_count'].shift(1))
df_new.head(50)

           day  day_count          %
0   2021-01-05          5        NaN
1   2021-01-09          4   0.800000
2   2021-01-10          4   1.000000
3   2021-01-11          1   0.250000
4   2021-01-12          1   1.000000
5   2021-01-13         18  18.000000
6   2021-01-14          4   0.222222
7   2021-01-15          3   0.750000
8   2021-01-16          3   1.000000
9   2021-01-17          2   0.666667
10  2021-01-18          4   2.000000
11  2021-01-20          5   1.250000
12  2021-01-21          8   1.600000
13  2021-01-24          2   0.250000
14  2021-01-25          5   2.500000
15  2021-01-26          6   1.200000
16  2021-01-27          3   0.500000
17  2021-01-29          5   1.666667
18  2021-01-30          2   0.400000
19  2021-01-31          8   4.000000
20  2021-02-01          9   1.125000
21  2021-02-02          2   0.222222
22  2021-02-03          5   2.500000
23  2021-02-05          9   1.800000
24  2021-02-06          9   1.000000
25  2021-02-08          9   1.000000
26  2021-02-09          5   0.555556
27  2021-02-10          6   1.200000
28  2021-02-11          6   1.000000
29  2021-02-13          4   0.666667
30  2021-02-14          2   0.500000
31  2021-02-15          9   4.500000
32  2021-02-16          3   0.333333
33  2021-02-17          6   2.000000
34  2021-02-18         11   1.833333
35  2021-02-20          2   0.181818
36  2021-02-21          2   1.000000
37  2021-02-22          2   1.000000
38  2021-02-24          3   1.500000
39  2021-02-25          1   0.333333
40  2021-02-26          9   9.000000
41  2021-02-28          2   0.222222
42  2021-03-01          5   2.500000
43  2021-03-02          2   0.400000
44  2021-03-03          2   1.000000
45  2021-03-04          2   1.000000
46  2021-03-05         10   5.000000
47  2021-03-06          2   0.200000
48  2021-03-07          3   1.500000
49  2021-03-09          1   0.333333

In [98]:
# the most decreasing amount of messages day in comparison to previous day. We skip days when there we no messages cau
df_new.min()

day          2021-01-05
day_count             1
%              0.041667
dtype: object

In [ ]:
import requests
import pandas as pd
import lxml

In [ ]:
url = 'https://teaching.healthtech.dtu.dk/22110/index.php/Codon_list'
html = requests.get(url).content
df_list = pd.read_html(html)
df = df_list[0]
df

In [ ]:
df = df.rename(columns={"Amino Acid": "Aminoacid", "DNA codons": "DNA_codons"})
df

In [ ]:
df['DNA_codons'] = df['DNA_codons'].str.strip('()').str.split(',',5,expand=False)
df

In [ ]:
df = df.explode('DNA_codons').reset_index(drop=True)
df

In [ ]:
aminoacid = df.loc[df['DNA_codons'] =='ATC', 'SLC'].iloc[0]
aminoacid

In [ ]:
f = df.loc[df['DNA_codons'] =='ATA', 'SLC']
f
# –º–æ–∂–Ω–æ –Ω–∞–π—Ç–∏ –∏–Ω–¥–µ–∫—Å –∏ –ø–æ –Ω–µ–º—É –≤—ã—Ç–∞—â–∏—Ç—å –∑–Ω–∞—á–µ–Ω–∏–µ –∞–º–∏–Ω–æ–∫–∏—Å–ª–æ—Ç—ã –≤—Ç–æ—Ä—ã–º –¥–µ–π—Å—Ç–≤–∏–µ–º

In [ ]:
ind = df.index[df['DNA_codons']=='ATC'].tolist()
ind